Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: བརྒྱ་བྱིན་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་དག་གི་ལྷའི་ཤེས་པ་བས། ཆེས་འཕགས་པ་དེ་བཞིན་གཤེགས་པའི་མཁྱེན་པ་བླ་ན་མེད་པ་དང་། དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་ཅན་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཚོགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་ཐམས་ཅད་བས་ཆེས་འཕགས་པའི་བྱིན་གྱིས་བརླབས་ཀྱིས། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་གྱི་སླད་དུ། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི། འཛམ་བུའི་གླིང་འདིར་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བཤད་དོ། །མིའི་རྒྱལ་པོའི་དགོས་པ་དང་།
en: The bhagavat arhat samyaksaṃbuddha teaches this Lord King of Sūtras, the Sublime Golden Light extensively in this Jambudvīpa for the sake of all beings so that the kings of humans who dwell throughout Jambudvīpa will have sovereignty; so that all beings will become happy; so that all domains will be guarded and defended; so that there will be no harm or enemies in all dominions; so that the armies of adversaries will be defeated and will retreat; so that there will be no disease or disturbances; so that human kings will light the great lamp of the Dharma and illuminate their own domains; so that the mansions of the devas will be filled with devas and their children; so that we, the Four Mahārājas, and our armies, attendants, and many hundreds of thousands of yakṣas, and all the hosts of devas that dwell in Jambudvīpa, will be satiated and worshiped; so that our divine bodies will increase in great magnificence; so that diligence, might, and great strength develop in our bodies; so that there will be good harvests; so that there will be happiness throughout all Jambudvīpa, which will become filled with beings and people; so that all beings who dwell in Jambudvīpa will be happy, experiencing various kinds of happiness; so that all beings will experience the vast, vast happiness of devas and humans for many hundreds of thousands of quintillions of eons; and so that they will be in the company of buddha bhagavats and in a future time will all attain the highest, most complete enlightenment.

source: རྒྱལ་པོའི་བསྟན་བཅོས་དང་། རྒྱལ་པོའི་བགྱི་བ་གང་དག་འཛམ་བུའི་གླིང་ཐམས་ཅད་ན་མཆིས་པ་དང་། གང་དག་གིས་སེམས་ཅན་འདི་དག་ཐམས་ཅད་བདེ་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཉེ་བར་བསྟན། ཡོངས་སུ་བརྗོད། ཡང་དག་པར་རབ་ཏུ་བཤད་དོ། །
en: “Whatever worldly or nonworldly kingly duties, treatises on kingship, or kingly deeds throughout Jambudvīpa bring happiness to all beings, they are all taught, described, and explained by the bhagavat arhat tathāgata samyaksaṃbuddha in thisLord King of Sūtras, the Sublime Golden Light.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་རྒྱུ་དེ་དང་རྐྱེན་དེས་མིའི་རྒྱལ་པོ་དེས། གདོན་མི་འཚལ་བར། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་གུས་པར་མཉན་པར་བགྱི། གུས་པར་རིམ་གྲོར་བགྱི། གུས་པར་མཆོད་པར་བགྱིའོ།། །
en: “Venerable Bhagavat, because of that cause and condition, a human king should reverently listen with conviction to this Lord King of Sūtras, the Sublime Golden Light, reverently worship it, and reverently make offerings to it.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དེའི་ཕྱིར་རྒྱལ་པོ་ཆེན་པོ་ཁྱེད་བཞི་དཔུང་དང་གཡོག་ཏུ་བཅས་པས། གདོན་མི་ཟ་བར་མིའི་རྒྱལ་པོ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཉན་པ་དང་། རིམ་གྲོ་བྱེད་པ་དང་མཆོད་པ་བྱེད་པ་དེ་དག་ཀུན་ཏུ་བསྲུང་བའི་ཕྱིར་སྤྲོ་བ་རྒྱ་ཆེར་གྱིས་ཤིག །
en: When the Four Mahārājas had said that, the Bhagavat said to them, “Therefore, you Four Mahārājas, with your army and attendants, should with great enthusiasm guard the kings who with conviction listen to, worship, and make offerings to this Lord King of Sūtras, the Sublime Golden Light.

source: རྒྱལ་པོ་ཆེན་པོ་དག་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གང་མདོ་སྡེའི་དབང་པོ་འདི་འཛིན་པ་དེ་དག་ཀྱང་། སངས་རྒྱས་ཀྱི་མཛད་པ་འཛིན་དུ་ཆུག་ཅིག་དང་།
en: “Mahārājas, you should cause the bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās who possess this lord king of sūtras to possess buddha activity.

source: དེ་དག་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་འདི་ལ་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པར་འགྱུར།
en: They will perform buddha activity in this world with its devas, humans, and asuras.

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་འཆད་པར་འགྱུར་ཏེ། རྒྱལ་པོ་ཆེན་པོ་ཁྱེད་བཞིས་ཅི་ནས་མདོ་སྡེའི་དབང་པོ་འཛིན་པའི་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ།
en: They will extensively and correctly teach this Lord King of Sūtras, the Sublime Golden Light.

source: དགེ་བསྙེན་མ་བསྲུང་བ་དང་། གནོད་པ་མེད་པ་དང་། ནད་མེད་པ་དང་། འཁྲུག་པ་མེད་པ་དང་། སེམས་བདེ་བར་འགྱུར་ཞིང་།
en: “You, the Four Mahārājas, should ensure that the bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās who possess this lord of sūtras are guarded, are unharmed, have no illness, have no disturbances, and are happy.

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་འགྱུར་བར། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་མདོ་སྡེའི་དབང་པོ་འཛིན་པ་དེ་དག་ཀུན་དུ་བསྲུང་བར་བྱ། ཡོངས་སུ་བསྐྱབ་པ་དང་། ཡོངས་སུ་གཟུང་བ་དང་། ཡོངས་སུ་བསྐྱང་བ་དང་། ཞི་བ་དང་། བདེ་ལེགས་སུ་འགྱུར་བར་བྱའོ། །
en: “Guard, defend, take in your care, protect, and bring peace and well-being to the bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās who will teach this Lord King of Sūtras, The Sublime Golden Light.”

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་སྟན་ལས་ལངས་ཏེ། འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ལ་ཡིད་བཞིན་གྱི་ནོར་བུ་ཞེས་བགྱི་བའི་གཟུངས་མཆིས་པ་འདི།
en: Then Mahārāja Vaiśravaṇa, rose from his seat and said, “Bhagavat, I have the dhāraṇī called the precious wish-fulfilling jewel.

source: སེམས་ཅན་གང་ལ་ལ་དག་འཛིན་ཅིང་འཆང་བར་མོས་པ་དེ་ལ། བསོད་ནམས་དཔག་ཏུ་མ་མཆིས་པར་འགྱུར་བ་དང་།
en: Any being who aspires to obtain it will have immeasurable merit.

source: རྟག་ཏུ་དེ་ལ་བདག་གིས་བསྲུང་ཞིང་བསྐྱབས་པས། དེའི་སྡུག་བསྔལ་ཐམས་ཅད་བསལ་ཏེ། བདེ་བར་གནས་པར་བགྱིའོ། །
en: I will constantly guard and defend them, dispel all their suffering, and establish them in happiness.

source: བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཀྱང་བསྐྱེད་པར་བགྱིའོ། །གང་གཟུངས་སྔགས་འདི་འཛིན་པར་འདོད་པས་ལུས་བསྲུང་བའི་ཕྱིར་སྔགས་འདི་སྔར་བརྗོད་པར་བྱའོ། །ན་མོ་བཻ་ཤྲ་བ་ཎཱ་ཡ། མ་ཧཱ་རཱ་ཛཱ་ཡ། ཏདྱ་ཐཱ། ར་ར་ར་ར། ཀུ་ནོ་ཀུ་ནོ། ཁུ་ནོ་ཁུ་ནོ། རུ་ནོ་རུ་ནོ། ས་བ་ས་བ། ཀ་ར་ཀ་ར། མ་ཧཱ་བི་ཀ་རཾ། མ་ཧཱ་བི་ཀ་རཾ། མ་ཧཱ་ཀཱ་ལ། མ་ཧཱ་རཱ་ཛ།
en: They will also generate the accumulations of wisdom and merit.

source: རཀྵ་རཀྵ་ཏུ་མཱཾ། སརྦ་སཏྭཱ་ནཱཉྩ་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་སྔགས་འདི་སྐུད་པ་དཀར་པོ་ལ་སྔགས་ལན་རེ་བཟླས་ཤིང་མདུད་པ་ལན་རེ་བོར་ཏེ། དེ་ལྟར་ལན་བདུན་བྱས་ནས། དཔུང་པ་ལ་བཏགས་ན་དོན་དེ་ངེས་པར་འགྲུབ་པར་འགྱུར་རོ། །
en: Those who wish to possess this dhāraṇī-mantra should first recite this mantra in order to protect their bodies: namo vaiśravaṇāya mahārājāya | tadyathā | rara rara kuno kuno khuno khuno ruṇo ruṇo saba saba kara kara mahāvikaraṃ mahāvikaraṃ mahākāla mahārāja rakṣa rakṣatu mām sarvasatvānāñ ca svāhā | “Bhagavat, by reciting this mantra and applying it seven times to a white cord, each time untying a knot—and after doing that seven times, tying it onto the upper arm—your goal will be certainly be achieved.

source: དེ་ནས་ཁང་པ་དབེན་པའི་ནང་དུ་ཁྲུས་བྱས་ལ་གོས་གཙང་མ་གྱོན་ཏེ། སྤོས་གུ་གུལ་དང་། ཙནྡན་དང་། ག་བུར་དང་། དུ་རུ་སྐ་དང་། ཨ་ག་རུ་དང་། སྤོས་དཀར་པོ་ལ་སོགས་པ་འདི་དག་ཆ་མཉམ་པར་སྦྱར་བའི་སྤོས་ཀྱིས་མཆོད་ཅིང་། སྔགས་འདི་བཟླས་པས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་སྤྱན་དྲང་བར་བྱའོ། །ན་མོ་བཻ་ཤྲ་བ་ཎཱ་ཡ། མ་ཧཱ་དྷ་ན་དཱ་ཡ། ཙཎྜེ་ཤྭ་རཱ་ཡ། ཨཱ་ཀརྵ། ཨ་པ་ར་ཛི་ཏ། ཙཎྜེ་ཤྭ་ར། པ་ར་མ། ཀཱ་རུ་ཎི་ཀ །སརྦ་སཏྭཱ།
en: “Then, in a solitary house, wash yourself and wear clean clothes.

source: ཧི་ཏ་ཙིནྟཱ། མ་མ་དྷ་ན་བར་དྷོ། པརྱེ་ཤྭ་ར་སྭ་ཡམ། ཨཱ་ཀརྵ་ཡ་སྭཱ་ཧཱ། སྔགས་འདི་ལན་བདུན་བཟླས་པའི་འོག་ཏུ་རྩ་བའི་སྔགས་བཟླས་པར་བྱའོ། །
en: Make an offering of incense that is a mixture of equal amounts of bdellium, sandalwood, camphor, frankincense, agarwood, valerian, and so on, and invoke Mahārāja Vaiśravaṇa by repeating this mantra: namo vaiśravaṇāya mahādhanadāya caṇḍeśvarāya ākarṣa aparājita caṇḍeśvara paramakāruṇika saravasatvāhitacintā mama dhanavardho parameśvara svayaṃ ākarṣaya svāhā | “After repeating that mantra seven times, repeat the root mantra.

source: སྔགས་འདི་འདོན་པའི་དུས་སུ་དཀོན་མཆོག་གསུམ་དང་། རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་ལ་སྔར་ཕྱག་འཚལ་བར་བྱའོ། །
en: Before repeating this mantra, bow down to the Three Jewels and Mahārāja Vaiśravaṇa.

source: རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་སྐོང་ཞིང་ནོར་སྦྱིན་པས་སེམས་ཅན་ཐམས་ཅད་བདེ་བར་མཛད་པའི་ཕྱིར་ཡིད་བཞིན་གྱི་ནོར་བུ་ཞེས་བྱ་བའི་སྔགས་འདི་བཟླས་ན། སེམས་ཅན་དེ་དག་ཡིད་བཞིན་དུ་བདེ་བ་རྙེད་པར་འགྱུར་རོ། །དེ་ནས་ལྷའི་རྒྱལ་པོ་རྣམ་ཐོས་ཀྱི་བུས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཡིད་བཞིན་གྱི་ནོར་བུ་ཞེས་བྱ་བའི་སྔགས་ཀྱི་སྙིང་པོ་འདི་སྨྲས་སོ། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། ན་མོ་བཻ་ཤྲ་བ་ཎཱ་ཡ། མ་ཧཱ་རཱ་ཛཱ་ཡ། ཏདྱ་ཐཱ། སི་མི་སི་མི། སུ་མུ་སུ་མུ། ཙཎྜ་ཙཎྜ། ཙ་ར་ཙ་ར། ས་ར་ས་ར། ཀ་ར་ཀ་ར། ཀི་ལི་ཀི་ལི། ཀུ་རུ་ཀུ་རུ། མུ་རུ་མུ་རུ། ཙུ་རུ་ཙུ་རུ།
en: If you repeat this mantra so that Mahārāja Vaiśravaṇa will fulfill the aspirations of all beings and bestow wealth, thereby bringing happiness to all beings, then those beings will attain the happiness they wish for.”

source: སནྡྷུ་ཡ། ཨཱཏྨ་ནཱཾ། ནི་ཏ་ཏྱ་ན། ཨནྟརྡྷཱ་ཏུ་སྭཱ་ཧཱ། ན་མོ་བཻ་ཤྲ་བ་ཎཱ་ཡ་སྭཱ་ཧཱ།
en: Then Vaiśravaṇa, the lord of devas, recited in the presence of the Bhagavat this essence mantra called the precious wish-fulfilling jewel: namo ratnarayāya | namo vaiśravaṇāya mahārājāya | tadyathā | simi simi sumu sumu caṇḍa caṇḍa cara cara, sara sara kara kara kili kili kuru kuru muru muru curu curu sandhāya ātmanām nitatyan antardhātu svāhā | namo vaiśravanāya svāhā | dhanadāya svāhā | manorathaparipūrāya svāhā | “After repeating this mantra a thousand times, in a solitary house make a small circle of cow dung and offer whatever food you have.

source: དྷ་ན་དཱ་ཡ་སྭཱ་ཧཱ། མ་ནོ་ར་ཐ་པ་རི་པཱུ་ར་ཡ་སྭཱ་ཧཱ། སྔགས་འདི་སྔར་ལན་སྟོང་བཟླས་པའི་འོག་ཏུ་ཁང་པ་དབེན་པའི་ནང་དུ་ལྕི་བས་དཀྱིལ་འཁོར་ཆུང་ངུ་ཞིག་བྱས་ཏེ་བཤོས་ཅི་འབྱོར་པས་མཆོད་པར་བྱའོ། །སྤོས་དམ་པ་བསྲེགས་པའི་དུ་བའི་རྒྱུན་མི་འཆད་པར་བྱ་ཞིང་ཉིན་མཚན་དུ་སེམས་རྩེ་གཅིག་པས་སྔགས་ཀྱི་སྙིང་པོ་འདི་བདག་ཉིད་ཀྱིས་ཐོས་པ་ཙམ་དུ་བཟླས་པ་བྱས་ན།
en: Continually release the smoke of burning excellent incense and single-mindedly repeat the essence mantra night and day, just loudly enough for you yourself to hear it.

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུའི་སྲས་ཛི་ནར་ཤ་བྷ་ཞེས་བྱ་བ་གཞོན་ནུའི་གཟུགས་ཀྱིས་དེའི་གན་དུ་མཆིས་ཏེ་ངའི་ཡབ་ལ་ཅི་ཞིག་གསོལ་ཞེས་དྲི་བར་བྱེད་དོ། །
en: “Then Jinarṣabha, the son of Mahārāja Vaiśravaṇa, will come to you in the form of a youth and ask you, ‘Why are you praying to my father?’

source: དེ་ནས་དེས་བདག་ནི་དཀོན་མཆོག་གསུམ་ལ་མཆོད་པའི་ཕྱིར། ནོར་ཞིག་གསོལ་གྱིས་སྩོལ་ཅིག་ཅེས་སྨྲོས་ཤིག །
en: Answer, ‘I am praying for wealth in order to make offerings to the Three Jewels; therefore, bestow it on me.’

source: དེ་ནས་སྲས་ཛི་ནར་ཤ་བྷས་ཡབ་ལ་གསོལ་བ། སྐྱེས་བུ་དམ་པ་ཞིག་དཀོན་མཆོག་གསུམ་ལ་མཆོད་པའི་ཕྱིར། ནོར་ཞིག་གསོལ་ལོ་ཞེས་གསོལ་པ་དང་།
en: “Then Jinarṣabha will supplicate his father, saying, ‘Father, there is an excellent being who is praying for wealth in order to make offerings to the Three Jewels, but because he is lacking in wealth, he is making a supplication to you.’

source: ཡབ་ཀྱིས་ཁྱོད་མྱུར་དུ་སོང་ལ་ཉིན་གཅིག་བཞིན་དུ་ཀཱ་པ་ཎ་བརྒྱ་བརྒྱ་བྱིན་ཅིག་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Then the father will say, ‘You go to him quickly and give him a hundred kārṣāpaṇas every day.’

source: དེ་ནས་སྔགས་སྒྲུབ་པ་དེས་ལྟས་དེ་ལྟ་བུ་མཐོང་ནས། དོན་དེ་གྲུབ་པར་ཤེས་ཏེ།
en: “If the mantra practitioners see such a sign, they should know that their goal is accomplished, and they should burn the incense alone in a solitary place.

source: གནས་དབེན་པར་བདག་གཅིག་པུ་སྤོས་བསྲེགས་ལ་ཉལ་ཁར་སྔས་སུ་དྲིའི་ཟ་མ་ཏོག་གཅིག་བཞག་སྟེ་ཉལ་བར་བྱའོ། །
en: When it is time to sleep, they should arrange a box of incense as a pillow to sleep on.

source: དེ་ཕྱིན་ཆད་ནང་གཅིག་བཞིན་དུ་ཟ་མ་ཏོག་དེའི་ནང་ནས་ནོར་ཅི་འབྱུང་བ་ལས་ནོར་དེ་དེའི་ཉིན་པར་དཀོན་མཆོག་གསུམ་ལ་མཆོད་པའི་ཡོ་བྱད་མེ་ཏོག་དང་། སྤོས་དང་། ཞལ་ཟས་ལ་སོགས་པར་སྦྱར་བ་དང་། བྲེལ་ཅིང་ཕོངས་པ་རྣམས་ལ་ཡང་སྦྱིན་ཞིང་ཟད་པར་བྱའོ། །
en: From then on, whatever wealth is found in that box each morning should be used for offerings to the Three Jewels, such as flowers, incense, and food, and should be all used up in acts of generosity to the poor and needy.

source: སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པར་བསམ་མོ། །
en: Think of all beings with love and compassion.

source: ཁྲོ་བ་དང་འཚེ་བའི་བསམ་པ་བསྐྱེད་ན། དེ་ཉམས་པར་འགྱུར་བས།
en: If you have thoughts of anger and violence, it will cause degeneration.

source: ཁྲོ་བའི་སེམས་མི་སྐྱེ་བར་རྟག་ཏུ་བསྲུང་བར་བྱའོ། །
en: Therefore, always be on guard that an angry mind does not arise.

source: དེ་ནས་ཡང་སྔགས་འདི་འཛིན་པ་དེས་ཉིན་གཅིག་བཞིན་དུ་ལྷའི་རྒྱལ་པོ་རྣམ་ཐོས་ཀྱི་བུ་དང་། གཞན་ཡང་སྲས་དང་། སྲས་མོའི་འཁོར་དུ་བཅས་པ་ལ། རྟག་པར་བསམ་ཞིང་། བསྟོད་པ་དང་།
en: “Also, someone who has this mantra should every day always be thinking of the deva king Vaiśravaṇa, and his sons, daughters, and entourage, and praise them and extol them.

source: བསྔགས་པ་བྱའོ། །རྟག་པར་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱིས་གཏོང་ཞིང་ལྷ་ལ་སོགས་པ་རྣམས་ཀྱི་མཐུ་དང་བསོད་ནམས་མངོན་པར་འཕེལ་བར་འགྱུར་བ་དང་། དགེ་བ་རྒྱས་པ་དང་། བླ་ན་མེད་པའི་བྱང་ཆུབ་ཀྱང་འཐོབ་པར་འགྱུར་རོ། །
en: That person will then always follow the path of the ten good actions, augment the power and merit of the deities, increase good actions, and also attain the highest enlightenment.

source: ལྷ་དེ་དག་གིས་དེ་ལྟར་བྱེད་པ་དེ་མཐོང་ནས་ཀུན་དགའ་ཞིང་མགུ་རངས་པས་འོང་ཞིང་དེ་ལ་བསྲུང་བ་དང་། སྐྱོབ་པར་བྱེད་དོ། །
en: “Those deities, seeing this being done, will be overjoyed and delighted, and they will come and guard and defend that individual.

source: སྔགས་མཁན་དེ་ཉིད་ཀྱང་ཚེ་ལོ་དཔག་ཏུ་མེད་པར་གནས་ཤིང་། ངན་སོང་གསུམ་ཡོངས་སུ་སྤོང་བ་དང་བགེགས་དང་། བར་ཆད་ཐམས་ཅད་ཀྱང་མེད་པར་འགྱུར་རོ། །
en: “Those mantra holders will also remain with an immeasurable lifespan, will avoid the three lower existences, and will have no obstacles or hindrances.

source: ཡིད་བཞིན་གྱི་ནོར་བུ་འདི་དང་། གཏེར་གཞན་དག་ཀྱང་ཐོབ་པར་འགྱུར་རོ། །རྫུ་འཕྲུལ་ལ་དབང་སྒྱུར་ཞིང་བསམ་པ་ཐམས་ཅད་ཀྱང་གྲུབ་པར་འགྱུར་རོ། །
en: They will obtain this precious wish-fulfilling jewel and other treasures, will gain miraculous powers, and will accomplish all their wishes.

source: གལ་ཏེ་ལོངས་སྤྱོད་ཅན་དུ་འདོད་ན་ཡང་ཡིད་བཞིན་དུ་གྲུབ་པ་དང་།
en: If they wish to have wealth that will be accomplished just as wished for.

source: བྱ་དང་གཅན་གཟན་གྱི་སྐད་ཐམས་ཅད་ཀྱང་ཤེས་པར་འགྱུར་རོ། །
en: They will know the languages of all birds and wild animals.

source: བཅོམ་ལྡན་འདས་སྔགས་སྒྲུབ་པ་དེས་བདག་མཐོང་བར་འཚལ་ན། ཚེས་བརྒྱད་དམ། ཚེས་བཅྭ་ལྔའི་ཉིན་པར་རས་དཀར་པོ་ལ་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་གཟུགས་ཀ་པི་ཏ་དང་སྦྱར་བའི་ཚོན་རྩིས་རྒྱན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ།
en: “Bhagavat, if those mantra practitioners wish to see me, then on the eighth or fifteenth day of the month they should paint an image of the Buddha with colors mixed with a binding medium and decorated with various adornments.

source: རི་མོ་མཁན་གསོ་སྦྱོང་གི་ཡན་ལག་བརྒྱད་དང་ལྡན་པས།
en: Such artists should take the eight vows.

source: སངས་རྒྱས་ཀྱི་གཡོན་ཕྱོགས་སུ་ནི་དཔལ་གྱི་ལྷ་མོའི་གཟུགས་བྲི།
en: They should paint an image of the great goddess Śrī on the Buddha’s left.

source: སངས་རྒྱས་ཀྱི་གཡས་ཕྱོགས་སུ་ནི་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་བདག་བུ་སྨད་དང་འཁོར་དུ་བཅས་པ་བྲིས་ཏེ། གནས་དེར་བཀྲམ་ནས།
en: On the Buddha’s right he should paint myself, King Vaiśravaṇa, with my children and entourage, and it should be displayed in that place.

source: མེ་ཏོག་སྣ་ཚོགས་དང་། དྲི་སྣ་མང་པོ་དང་། མར་མེ་དམ་པ་དང་། ཞལ་ཟས་བདའ་བ་སྣ་ཚོགས་ཀྱིས། ཉིན་མཚན་རྒྱུན་མི་འཆད་པར་མཆོད་པར་བྱའོ། །
en: “Make offerings constantly, day and night, of various flowers, many scents, excellent lights, and various kinds of delicious food.

source: སྔགས་འདི་ཟློས་པས་སེམས་མི་གཡེང་བར་བྱ་ཞིང་། རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་སྤྱན་དྲང་བའི་སྔགས་འདི་བཟླས་པར་བྱའོ། །ན་མཿཤྲཱི་ཀཎ་ཋཱ་ཡ། བུད་དྷཱ་ཡ། ན་མོ་བཻ་ཤྲ་བ་ཎཱ་ཡ། ཡཀྵ་རཱ་ཛཱ་ཡ། མ་ཧཱ་རཱ་ཛཱ་ཡ། ཨ་ཏི་རཱ་ཛཱ་ཡ། ན་མཿཤྲཱི། མ་ཧཱ་དེ་བྱཻ། ཏདྱ་ཐཱ། ཏ་ར་ཏ་ར། ཏུ་རུ་ཏུ་རུ། བ་ར་བ་ར། སུ་ཤུདྡྷོ་སུ་ཤུདྡྷོ། ཧ་ན་ཧ་ན། མ་ཎི་ཀ་ན་ཀ །བཛྲ་བཻ་ཌཱུརྱ།
en: “Keep your mind undistracted by repeating this mantra.

source: མུཀ་ཏི་ཀ །ཨ་ལཾ་ཀྲྀ་ཀྲཱི་ཏ་ཤ་རཱི་རཱ་ཡ། སརྦ་སཏྭཱ། ཧི་ཏ་ཀཱ་མ། བཻ་ཤྲ་བ་ཎ་ཤྲཱི་ཡ་དེ་བཱི་པྲ་བྷཱ་ཡ། ཨེ་ཧི་ཨེ་ཧི། མཱ་བི་ལམྦ། གྷཱུརྞ་གྷཱུརྞ། པ་ར་སྱ་པ་ར་སྱ། ད་དཱ་ཧི་མ་མཱ། དརྴ་ན་ཀཱ་མ་སྱ། དརྴ་ནྃ། མ་མ་མ་ན། པྲ་ལ་ཧ་དཱ་ཡ་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་བདག་གིས་སྔགས་ཟློས་པ་དེ་དང་། མཆོད་པ་རྒྱ་ཆེན་པོ་མཐོང་ནས། བདག་བྱམས་པ་དང་། དགའ་བའི་བསམ་པ་སྐྱེས་ནས། བདག་དེའི་མདུན་དུ་བྱིས་པ་གཞོན་ནུའི་གཟུགས་སམ། ཡང་ན་རྒན་པོའམ། དགེ་སློང་གི་གཟུགས་སུ་བྱས་ཏེ།
en: Repeat this mantra that invites Mahārāja Vaiśravaṇa: namaḥ śrīkaṇṭhāya buddhāya | namo vaiśravaṇāya, yakṣarājāya mahārājāya atirājāya | namaḥ śrī mahādeviyai | tadyathā | tara tara turu turu vara vara, suśuddho suśuddho hana hana maṇikanaka vajravaidūrya muktika alaṃkṛta sarirāya sarvasatvānāṃ hitakāma vaiśravaṇa śriyadevīprabhāya ehi ehi māvilamba ghūrṇa ghūrṇa parasya parasya dadāhi mama amukanāsya | darśanakāmasya darśanaṃ mama mana pralahadāya svāhā | “Bhagavat, when I see someone repeating this mantra and making vast offerings, I give rise to thoughts of affection and rejoicing, and take on the form of a young child, or an old man, or a bhikṣu.

source: བདག་ལག་ན་ཡིད་བཞིན་གྱི་ནོར་བུ་གསེར་གྱི་སྣོད་དང་བཅས་པ་ཐོགས་ཏེ། དཀྱིལ་འཁོར་གྱི་ནང་དུ་ཞུགས་ནས། ལུས་ཀྱིས་གུས་པ་སྟོན་ཅིང་། སངས་རྒྱས་ཀྱི་མཚན་གཅིག་ཏུ་བརྗོད་དེ། སྔགས་མཁན་དེ་ལ་འདི་སྐད་ཅེས་སྨྲའོ། །
en: Holding the precious wish-fulfilling jewel in a bowl of gold in my hands, I will enter the circle and show veneration with my body, speak one name of the Buddha, and will say to the one who is reciting the mantra, ‘Whatever you practice will all be accomplished.’

source: ཁྱོད་ཅི་དང་ཅི་སློང་བ་དེ་དག་ཐམས་ཅད་གྲུབ་པར་བྱས་ཏེ། ནགས་ཚལ་དབེན་པར་འགྲོ་འདོད་པའམ། ནོར་བུ་རིན་པོ་ཆེ་འདོད་པའམ། མི་མང་པོའི་ཡིད་དུ་འོང་བར་འདོད་པའམ། གསེར་དང་། དངུལ་ལ་སོགས་པའི་ནོར་འདོད་པའམ། སྔགས་གཞན་སྒྲུབ་པའི་དངོས་གྲུབ་འདོད་པའམ། རྫུ་འཕྲུལ་དང་།
en: “Whether they wish to enter the solitude of a forest, wish to obtain precious jewels, wish to be attractive to many people, wish to acquire wealth such as gold and silver, wish for accomplishment through the practice of another mantra, or wish to have miraculous powers, the higher cognitions, a long life, or rasāyana, and so on, all will be accomplished as wished for.

source: མངོན་པར་ཤེས་པ་དང་། ཚེ་རིང་བར་འདོད་པ་དང་། སྨན་བཅུད་ཀྱིས་ལེན་འདོད་པ་ལ་སོགས་པ་ཐམས་ཅད་བསམ་པ་བཞིན་དུ་གྲུབ་པར་བྱའོ། །བདག་གིས་དངོས་པོ་དེ་དག་ལ་སོགས་པ་མདོ་ཙམ་ཞིག་སྨོས་པར་ཟད་ཀྱི། དེ་མ་ཡིན་པ་གཞན་ཞིག་འདོད་ན་ཡང་ཐམས་ཅད་བསམ་པ་བཞིན་དུ་ཡོངས་སུ་གྲུབ་པར་བྱ་སྟེ།
en: “I have today mentioned only such few things, but every other desire will be accomplished as wished for.

source: རིན་པོ་ཆེའི་གཏེར་མི་ཟད་པ་དང་། བསོད་ནམས་ཚད་མེད་པ་དང་ལྡན་པར་འགྱུར་རོ། །
en: They will possess unceasing precious treasures and immeasurable merit.

source: དཔེར་ན་ཉི་ཟླ་འདི་ས་ལ་ལྷུང་བར་འགྱུར་བ་དང་། ས་ཆེན་པོ་འདི་གཞན་དུ་འགྱུར་བའི་དུས་ནི་ཡོད་ཀྱང་སྲིད་ཀྱི། བདེན་པའི་ཚིག་འདི་ནི་ནམ་ཡང་སླུ་བར་མི་འགྱུར་བས་རྟག་ཏུ་བདེ་བ་དང་། ཡིད་བཞིན་དུ་སྐྱིད་པ་དང་ལོངས་སྤྱོད་པ་ཐོབ་པར་འགྱུར་རོ། །
en: “To illustrate, it is possible that the sun and moon might fall onto the earth, or there might be a time when this great earth transforms into something else, but these words of truth will always be infallible so that constant happiness and the joys and riches that are wished for will be obtained.

source: གཞན་ཡང་བཅོམ་ལྡན་འདས་མདོ་སྡེའི་རྒྱལ་པོ་འདི་གང་ཞིག་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་འདོན་པ་ཡང་རུང་། སྔགས་འདི་སྒྲུབ་པ་ཡང་རུང་སྟེ། ཚེགས་ཆུང་ངུས་མྱུར་དུ་འགྲུབ་པར་འགྱུར་རོ། །
en: “Moreover, Bhagavat, if it is someone who possesses this king of sūtras, keeps it, or reads and recites it, or practices this mantra, they will quickly attain accomplishment with little difficulty.

source: བཅོམ་ལྡན་འདས་བདག་གིས་སེམས་ཅན་དབུལ་ཞིང་ཕོངས་པའི་སྡུག་བསྔལ་གྱིས་ཉེན་པའི་སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་སྔགས་འདི་བཤད་པས། དེ་ཕྱུག་ཅིང་བདེ་བའི་མཆོག་དང་ཕུན་སུམ་ཚོགས་པ་ཚེ་གཅིག་ཏུ་འབྱོར་བར་འགྱུར་རོ། །
en: “Bhagavat, today I have taught this mantra for the sake of beings who are afflicted by the suffering of poverty and need; in one lifetime they will possess a perfection of wealth and supreme happiness.

source: བདག་གིས་ཀྱང་དེ་ཡོངས་སུ་བསྲུང་ཞིང་བསྐྱབ་པའི་ཕྱིར། རྗེས་སུ་འབྲང་ཞིང་གནོད་པ་དང་། འཚེ་བ་ཐམས་ཅད་མ་མཆིས་པར་བགྱིའོ། །
en: “I will also guard them, defend them, and follow them so that there will be no harm or violence toward them.

source: གཞན་ཡང་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་དེ་འཛིན་ཅིང་རྒྱས་པར་བྱེད་པ་དང་། སྔགས་འདི་འཆང་བའི་གང་ཟག་དེ་གོམ་པ་བརྒྱ་ཚུན་ཆད་འོད་ཀྱིས་སྣང་བར་བྱས་ཏེ།
en: “Moreover, I will illuminate with light as far as a hundred steps all around an individual who possesses and promulgates this Lord King of Sūtras, the Sublime Golden Light, and recites the mantra.

source: བདག་གི་འཁོར་གནོད་སྦྱིན་སྟོང་རྣམས་ཀྱིས་ཀྱང་རྟག་ཏུ་དེའི་གཡོག་ཏུ་བསྐོ་ཞིང་མངག་གཞུག་ཡིད་བཞིན་དུ་བྱེད་དུ་གཞུག་གོ། །
en: My entourage of a thousand yakṣas will be constantly assigned and entrusted to be his servants and entrusted to accomplish whatever he wishes.

source: བདག་གི་བདེན་པའི་ཚིག་འདི་སླུ་བ་མེད་པར་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་སུ་གསོལ།
en: “I pray for the Bhagavat to view my words of truth to be infallible.”

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུས་སྔགས་དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ལེགས་སོ་ལེགས་སོ་ཞེས་བཀའ་སྩལ་ཏེ། རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་སྲེད་པས་གདུངས་པའི་སྡུག་བསྔལ་གྱི་དྲ་བ་ཐམས་ཅད་བྲལ་བས་ཕྱུག་ཅིང་བདེ་བར་བྱ་བའི་ཕྱིར་སྔགས་འདི་སྨྲས་པ་དང་། གཞན་ཡང་མདོ་སྡེ་འདི་འཇིག་རྟེན་དུ་ཡོངས་སུ་རྒྱས་པར་བྱ་བའི་ཕྱིར། སྔགས་འདི་བཤད་པ་ནི་ལེགས་སོ་ལེགས་སོ། །
en: Mahārāja Vaiśravaṇa having spoken that mantra, the Bhagavat congratulated him, saying, “It is excellent, excellent that you, Mahārāja, have spoken this mantra in order to tear open all the nets of the suffering of all beings afflicted by craving, and to make them wealthy and happy, and that you moreover have taught this mantra in order to promulgate this sūtra widely in the world.”

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་སྟན་ལས་ལངས་ནས། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། དེའི་ཚེ་མངོན་སུམ་དུ་ཚུལ་དང་མཐུན་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས། བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་དོ། །རྒྱལ་བ་ཟླ་བ་དྲི་མ་མེད་པའི་སྐུ། །
en: Then the Four Mahārājas rose from their seats, and with their upper robes over one shoulder, knelt on their right knee, bowed with palms together, and paid homage by placing the Buddha’s two feet on their heads.

source: རྒྱལ་བ་ཉི་མ་འོད་ཟེར་སྟོང་གི་འོད། །རྒྱལ་བ་པདྨ་དྲི་མ་མེད་པའི་སྤྱན། །རྒྱལ་བ་མེ་ཏོག་པད་རྩ་རྡུལ་མེད་ཚེམས། །རྒྱལ་བའི་ཡོན་ཏན་རྒྱ་མཚོ་ལྟ་བུ་སྟེ། །རིན་པོ་ཆེ་ནི་དུ་མའི་འབྱུང་གནས་གྱུར། །རྒྱལ་བ་རྒྱ་མཚོ་ཡེ་ཤེས་ཆུ་ཡིས་གང་། །ཏིང་འཛིན་བརྒྱ་ཕྲག་སྟོང་གིས་ཀུན་དུ་གང་། །རྒྱལ་བའི་ཞབས་ནི་འཁོར་ལོས་བྲིས་འདྲ་སྟེ། །ཁོར་ཡུག་མུ་ཁྱུད་དེ་བཞིན་རྩིབ་མ་སྟོང་། །ཕྱག་དང་ཞབས་ནི་དྲ་བས་སྤྲས་པ་སྟེ། །ཞབས་ཀྱི་དྲ་བ་ངང་པའི་དབང་པོ་བཞིན། །གསེར་གྱི་རི་བོ་ལྟ་བུར་རབ་ཏུ་གདའ། །རྒྱལ་བ་དྲི་མེད་གསེར་གྱི་རི་དབང་རྒྱལ། །ཡོན་ཏན་ཐམས་ཅད་རི་དབང་འདྲ་བ་སྟེ། །
en: At that time, they directly praised the Bhagavat with these appropriate verses: “To the stainless moon of the Jina’s body, To the light of the thousand rays of the Jina’s sun, To the stainless lotuses of the Jina’s eyes, And to the spotless lotus roots of the Jina’s teeth; “To the sea of the Jina’s qualities That is the source of many jewels; To the Jina’s ocean filled with the water of wisdom That is pervaded by hundreds of thousands of samādhis; “To the Jina’s feet with the design of wheels, With hubs, rims, and a thousand spokes; To the hands and feet beautified by webs, The webs of the feet like those of the lord of geese; “And to the mountain of the Jina that is stainless gold And that is shining like a golden mountain, Who, like Meru, possesses all qualities— To the Jina, the lord of mountains, we pay homage.

source: སངས་རྒྱས་རི་དབང་རྒྱལ་ལ་ཕྱག་འཚལ་ལོ། །དེ་བཞིན་གཤེགས་པའི་ཟླ་བ་ཆུ་ཟླ་འདྲ། །ནམ་མཁའ་དང་ཡང་མཚུངས་ཤིང་འདྲ་བ་སྟེ། །སྒྱུ་མ་སྨིག་རྒྱུ་ལྟ་བུར་ཆགས་མེད་པ། །རྒྱལ་བ་དྲི་མ་མེད་ལ་ཕྱག་འཚལ་ལོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། སྟོབས་བཅུ་དག་གིས་གསེར་འོད་དམ་པ་ཡི། །མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་རབ་མཆོག་འདི། །
en: “To the Tathāgata who is like the sun and moon, To the one who is similar to and equal to space, Who has no impediment like a mirage or illusion, To the stainless Jina we pay homage.”
